Repository: quarkusio/cn.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en
Languages: zh_cn

source: `quarkus.oidc.runtime.OidcProviderClient` is used when a remote request to an OpenID Connect Provider has to be done. If the bearer token has to be introspected then `OidcProviderClient` has to authenticate to the OpenID Connect Provider. Please see xref:security-openid-connect-web-authentication.adoc#oidc-provider-client-authentication[OidcProviderClient Authentication] for more information about all the supported authentication options.
zh_cn: 属性 `quarkus.oidc.runtime.OidcProviderClient` 是在需要对OpenID连接提供者进行远程请求时使用的。如果必须对不记名令牌进行检查，那么 ，必须对OpenID Connect Provider进行认证。请参阅 `OidcProviderClient` link:security-openid-connect-web-authentication.html#oidc-provider-client-authentication[OidcProviderClient 认证] 以了解更多关于所支持认证选项的信息。

source: `quarkus.test.profile.tags=foo`: In this case none of tests will be executed because none of the tags defined on the `QuarkusTestProfile` implementations match the value of `quarkus.test.profile.tags`. Note that `NoQuarkusProfileTest` is not executed either because it is not annotated with `@TestProfile`.
zh_cn: `quarkus.test.profile.tags=foo` :在这种情况下，所欧测试都不会被执行，因为在 `QuarkusTestProfile` 实现上定义的标签中没有一个与 `quarkus.test.profile.tags` 的值相匹配。注意， `NoQuarkusProfileTest` 也不会被执行，因为它没有 `@TestProfile` 注解。

source: `quarkus.test.profile.tags=test1,test3`: This case results in the same tests being executed as the previous case.
zh_cn: `quarkus.test.profile.tags=test1,test3` :这种情况下，执行的测试与前一种情况相同。

source: `quarkus.test.profile.tags=test1`: In this case `SingleTagTest` and `MultipleTagsTest` will be run because the tags on their respective `QuarkusTestProfile` implementations match the value of `quarkus.test.profile.tags`.
zh_cn: `quarkus.test.profile.tags=test1` :在这种情况下， `SingleTagTest` 和 `MultipleTagsTest` 将被运行，因为它们各自的 `QuarkusTestProfile` 实现的标签与 `quarkus.test.profile.tags` 的值一致。

source: `quarkus.test.profile.tags=test2,test3`: In this case only `MultipleTagsTest` will be run because `MultipleTagsTest` is the only `QuarkusTestProfile` implementation whose `tags` method matches the value of `quarkus.test.profile.tags`.
zh_cn: `quarkus.test.profile.tags=test2,test3` :在这种情况下，只有 `MultipleTagsTest` 会被运行，因为 `MultipleTagsTest` 是唯一一个 `tags` 方法与 `quarkus.test.profile.tags` 的值相匹配的 `QuarkusTestProfile` 实现。

source: `quarkus.test.profile.tags` is not set: All tests will be executed.
zh_cn: `quarkus.test.profile.tags` 未被设置。所有的测试都将被执行。

source: `quarkus:dev` runs Quarkus in development mode. This enables live reload with background compilation, which means that when you modify your Java files and/or your resource files and refresh your browser, these changes will automatically take effect. This works too for resource files like the configuration property file. Refreshing the browser triggers a scan of the workspace, and if any changes are detected, the Java files are recompiled and the application is redeployed; your request is then serviced by the redeployed application. If there are any issues with compilation or deployment an error page will let you know.
zh_cn: `quarkus:dev` 在开发模式下运行Quarkus。这使得后台编译的实时重载成为可能，这意味着当你修改你的Java文件或者资源文件并刷新你的浏览器时，这些变化将自动生效。这也适用于资源文件，如配置属性文件。刷新浏览器会触发对工作区的扫描，如果检测到任何变化，Java文件会被重新编译，应用程序会被重新部署；然后你的请求会被重新部署的应用程序提供服务。如果编译或部署有任何问题，错误页面会让你知道。

source: `reject` - this strategy marks the AMQP message as rejected. The processing continues with the next message. Refer to the http://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-messaging-v1.0-os.html#type-rejected[rejected delivery state documentation].
zh_cn: `reject` - 这个策略将该AMQP消息标记为拒绝。继续处理下一条消息。请参考 link:http://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-messaging-v1.0-os.html#type-rejected[被拒绝的交付状态的文档] 。

source: `release` - this strategy marks the AMQP message as _released_. The processing continues with the next message. The broker can redeliver the message. Refer to the http://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-messaging-v1.0-os.html#type-released[released delivery state documentation].
zh_cn: `release` - 这个策略将AMQP消息标记为 _released_ 。继续处理下一条消息。代理可以重新交付消息。请参考 link:http://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-messaging-v1.0-os.html#type-released[被释放的交付状态的文档] 。

source: `request` a message and expect a reply
zh_cn: `request` 留言并期望得到回复

source: `resteasy-reactive-jackson`, which also brings `resteasy-reactive`. We are going to use it to expose our HTTP endpoints.
zh_cn: `resteasy-reactive-jackson` ，它也带来了 `resteasy-reactive` 。我们将使用它来暴露出我们的HTTP端点。

source: `sam.jvm.yaml` - (optional) for use with sam cli and local testing
zh_cn: `sam.jvm.yaml` - (可选)用于sam cli和本地测试

source: `sam.native.yaml` - (optional) for use with sam cli and native local testing
zh_cn: `sam.native.yaml` - (可选)，用于Sam cli和原生本地测试

source: `send` a message to a specific address - one single consumer receives the message.
zh_cn: `send` 一个消息到一个特定的地址 - 单个消费者收到该消息。

source: `set? <singleColumnName>` (and single parameter) which will expand to `update from EntityName set <singleColumnName> = ?`
zh_cn: `set? <singleColumnName>` (带单个参数）语句会被扩展为： `update from EntityName set <singleColumnName> = ?`

source: `set? <update-query>` will expand to `update from EntityName set <update-query>`
zh_cn: `set? <update-query>` 语句会被扩展为： `update from EntityName set <update-query>`

source: `short` and `java.lang.Short`
zh_cn: `short` 和 `java.lang.Short`

source: `status in ?1` will be mapped to `{'status':{$in: [?1]}}`
zh_cn: `status in ?1` 将被映射到 `{'status':{$in: [?1]}}`

source: `tags` should be used with some care as an archive page is created for of them. Below are some basic rules to try follow:
zh_cn: `tags` 应该谨慎使用，因为存档页面是为它们创建的。以下是一些你可以尝试遵循的基本规则：

source: `user-story` used for stories from users/companies adopting Quarkus.
zh_cn: `user-story` 用于用户/公司采用Quarkus的故事。

source: `vertx`, which provides access to the underlying managed Vert.x
zh_cn: `vertx` ，它提供了对底层管理的Vert.x的访问

source: `{'firstname' : ?1, 'status' : ?2}` will be mapped to the update document `{'$set' : {'firstname': ?1, 'status': ?2}}`
zh_cn: `{'firstname' : ?1, 'status' : ?2}` 将被映射到更新文档中 `{'$set' : {'firstname': ?1, 'status': ?2}}`

source: `{'firstname' : firstname, 'status' : :status}` ` will be mapped to the update document `{'$set' : {'firstname': :firstname, 'status': :status}}`
zh_cn: `{'firstname' : firstname, 'status' : :status}` `将被映射到更新文档中。 `{'$set' : {'firstname': :firstname, 'status': :status}}`

source: a landing page that is accessible on `http://localhost:8080` after starting the application
zh_cn: 启动应用程序后，可以通过 `http://localhost:8080` 访问的登陆页面

source: a message containing the _name_ is sent to the event bus
zh_cn: 含有该 _name_ 的消息被发送到事件总线

source: a non-anonymous caller name of jdoe@quarkus.io
zh_cn: 一个非匿名的呼叫者的名字是 jdoe@quarkus.io

source: a non-null JsonWebToken
zh_cn: 一个非空的JsonWebToken

source: accessing `/api/admin` will return `200`
zh_cn: 访问 `/api/admin` ，将返回 `200`

source: accessing `/api/admin` will return `403`
zh_cn: 访问 `/api/admin` ，将返回 `403`

source: accessing `/api/users/me` will return `200`
zh_cn: 访问 `/api/users/me` ，将返回 `200`

source: activate the `migrate-at-start` option to migrate the schema automatically or inject the `Flyway` object and run your migration as you normally do
zh_cn: 激活 `migrate-at-start` 选项来自动迁移表，或者添加 `Flyway` 对象，然后像通常那样运行迁移。

source: add a tech specific, like `kafka`, if your post has a significant mention/relevance to that technology.
zh_cn: 如果你的帖子与该技术有显著的相关性，可以添加一个技术细节，比如 `kafka`。

source: add new fruits to the list via the form
zh_cn: 通过表格添加新的fruits到列表中

source: add your migrations to the `{migrations-path}` folder as you usually do with Flyway
zh_cn: 像通常使用Flyway那样，将你的迁移文件添加到 `{migrations-path}` 文件夹中。

source: add your settings in `{config-file}`
zh_cn: 在 `{config-file}` 中添加你的设置

source: all files in the `foo/` directory and its subdirectories except for files in `foo/private/` and its subdirectories,
zh_cn: `foo/` 目录及其子目录中的所有文件，但 `foo/private/` 及其子目录中的文件除外

source: all text files in the `bar/` directory and its subdirectories.
zh_cn: `bar/` 目录及其子目录下的所有文本文件

source: all the Reactive Messaging AMQP channels have the `host` or `port` attributes set
zh_cn: 所有的Reactive Messaging AMQP通道都设置了 `host` 或 `port` 属性

source: all the Reactive Messaging Kafka channels have either the `apicurio.registry.url` attribute or the `schema.registry.url` attribute set
zh_cn: 所有响应式消息Kafka通道都设置了 `apicurio.registry.url` 属性或 `schema.registry.url` 属性

source: all the Reactive Messaging Kafka channels have the `bootstrap.servers` attribute set
zh_cn: 所有的Reactive Messaging Kafka通道都设置了 `bootstrap.servers` 属性

source: an IDE
zh_cn: 一个编辑器

source: an `enforcedPlatform` directive for the Quarkus BOM
zh_cn: `enforcedPlatform` ，用于指示Quarkus BOM

source: an `org.acme.GreetingResource` resource exposed on `/hello`
zh_cn: 通过 `/hello` 暴露出来的 `org.acme.GreetingResource` 资源

source: an associated unit test
zh_cn: 相关的单元测试

source: an authentication scheme of Bearer
zh_cn: 一个不记名(bearer)的认证方案

source: and enabled at runtime with a system property or environment variable, for example: `-Dquarkus.http.auth.permission.permit1.enabled=true`.
zh_cn: 并在运行时通过系统属性或环境变量启用，例如： `-Dquarkus.http.auth.permission.permit1.enabled=true` 。

source: and executed with `java -jar target/quarkus-app/quarkus-run.jar`.
zh_cn: 并可以使用 `java -jar target/quarkus-app/quarkus-run.jar` 来执行。

source: and finally write the test code, for example:
zh_cn: 并最终写出测试代码，例如：

source: and in native mode:
zh_cn: 在原生模式(native mode)下：

source: and in the case of using the Maven configuration instead of `application.properties`:
zh_cn: 以及在使用Maven配置而不是 `application.properties` :

source: and more
zh_cn: 更多

source: and update `application.properties` to get all the CDI producers provided by `smallrye-jwt` included as follows:
zh_cn: 并更新 `application.properties` ，以获得所有由 `smallrye-jwt` 提供的CDI生产者，包括如下：

source: and write a test code like this one:
zh_cn: 写一个测试代码如同下面这样的：

source: and you should see output similar to:
zh_cn: 而你应该看到类似的输出：

source: and your configuration indicates that the `generated-price` channel uses the `smallrye-kafka` connector, then Quarkus will automatically set the `value.serializer` to Kafka's built-in `IntegerSerializer`.
zh_cn: 而您的配置表明 `generated-price` channel 使用了 `smallrye-kafka` 连接器，那么Quarkus会自动将 `value.serializer` 设置为Kafka内置的 `IntegerSerializer` 。

source: and your configuration indicates that the `my-kafka-records` channel uses the `smallrye-kafka` connector, then Quarkus will automatically set the `key.deserializer` to Kafka's built-in `LongDeserializer`, as well as the `value.deserializer` to `ByteArrayDeserializer`.
zh_cn: 并且您的配置表明 `my-kafka-records` channel 使用了 `smallrye-kafka` 连接器，那么Quarkus会自动将 `key.deserializer` 设置为Kafka内置的 `LongDeserializer` ，以及 `value.deserializer` 设置为 `ByteArrayDeserializer` 。

source: and your configuration indicates that the `price-create` channel uses the `smallrye-kafka` connector, then Quarkus will automatically set the `value.serializer` to Kafka's built-in `DoubleSerializer`.
zh_cn: 而您的配置表明 `price-create` channel 使用 `smallrye-kafka` 连接器，那么Quarkus将自动将 `value.serializer` 设置为Kafka内置的 `DoubleSerializer` 。

source: annotate your entities with `@Entity`
zh_cn: 给实体类增加 `@Entity` 注解

source: application.properties for TokenSecuredResource
zh_cn: TokenSecuredResource的application.properties

source: assign your consumer to a consumer group not used by any other application.
zh_cn: 将您的消费者分配到一个不被任何其他程序使用的消费者组。

source: authScheme is null
zh_cn: authScheme为null

source: birthdate claim value
zh_cn: birthdate声明(claim)的值

source: blog
zh_cn: 博客

source: classes for which a direct implementation of `org.apache.kafka.common.serialization.Serializer<T>` / `org.apache.kafka.common.serialization.Deserializer<T>` is present.
zh_cn: 直接实现了 `org.apache.kafka.common.serialization.Serializer<T>` / `org.apache.kafka.common.serialization.Deserializer<T>` 的类。

source: classes for which a subclass of `JsonbSerializer` / `JsonbDeserializer` is present, as described in <<jsonb-serialization>>
zh_cn: `JsonbSerializer` / `JsonbDeserializer` 的子类，如 link:#jsonb-serialization[[jsonb序列化]] 中所述

source: classes for which a subclass of `ObjectMapperSerializer` / `ObjectMapperDeserializer` is present, as described in <<jackson-serialization>>
zh_cn: `ObjectMapperSerializer` / `ObjectMapperDeserializer` 的子类，如 link:#jackson-serialization[[jackson序列化]] 中所述

source: classes generated from Avro schemas, as well as Avro `GenericRecord`, if Confluent or Apicurio Registry _serde_ is present
zh_cn: 从Avro Schema生成的类，类似于Avro `GenericRecord`。如果Confluent或Apicurio Registry _serde_ 存在的话

source: cloud
zh_cn: 云

source: contains the right set of dependencies (glibc, libstdc++, zlib)
zh_cn: 包含正确的依赖项（glibc、libstdc++、zlib）

source: copy `privateKey.pem` from the `integration-tests/oidc-tenancy` in the `main` Quarkus repository and use a test code similar to the one in the `Wiremock` section above to generate JWT tokens. You can use your own test keys if preferred.
zh_cn: 从 `main` Quarkus资源库中的 `integration-tests/oidc-tenancy` 中复制 `privateKey.pem` ，并使用类似于上面 `Wiremock` 部分的测试代码来生成JWT令牌。如果愿意，你可以使用你自己的测试密钥。

source: create an author entry in [_data/authors.yaml](https://github.com/quarkusio/quarkusio.github.io/blob/develop/_data/authors.yaml)
zh_cn: 创建一个作者条目在 [_data/authors.yaml](https://github.com/quarkusio/quarkusio.github.io/blob/develop/_data/authors.yaml)

source: create an blog entry under [_posts](https://github.com/quarkusio/quarkusio.github.io/tree/develop/_posts)
zh_cn: 创建一个博客条目在 [_posts](https://github.com/quarkusio/quarkusio.github.io/tree/develop/_posts)

source: create the native executable with:
zh_cn: 创建本地可执行文件。

source: curl Command for /secured/roles-allowed With JWT
zh_cn: 用curl命令带上所需的JWT来访问/secured/roles-allowed

source: curl command for /secured/permit-all
zh_cn: 用curl命令访问/secured/permit-all

source: curl command for /secured/roles-allowed
zh_cn: 用curl 命令访问/secured/roles-allowed

source: designed for containers
zh_cn: 专为容器而设计的

source: e.g.,
zh_cn: 比如：

source: enable the _development mode_ (hot reload)
zh_cn: 开启 _开发模式_ (热重载)

source: example `Dockerfile` files for both `native` and `jvm` modes in `src/main/docker`
zh_cn: 示例 `Dockerfile` 文件，用于 `native` 和 `jvm` 两种模式，在 `src/main/docker`

source: execute it with `./target/rest-json-quickstart-1.0.0-SNAPSHOT-runner`
zh_cn: 用以下方式执行它 `./target/rest-json-quickstart-1.0.0-SNAPSHOT-runner`

source: filter extensions
zh_cn: 筛选扩展

source: gRPC endpoint for sending spans
zh_cn: 用于发送spans的gRPC节点

source: has to be registered via `src/main/resources/META-INF/services/io.quarkus.test.junit.callback.QuarkusTestBeforeEachCallback` as follows:
zh_cn: 该回调类必须通过 `src/main/resources/META-INF/services/io.quarkus.test.junit.callback.QuarkusTestBeforeEachCallback` 注册，具体如下：

source: hasJWT is false
zh_cn: hasJWT为false

source: hit `Ctrl+C` to stop the application
zh_cn: 点击 `Ctrl+C` ，停止应用程序。

source: how to compile your application natively
zh_cn: 如何原生地编译你的应用程序

source: how to create and scaffold a new project
zh_cn: 如何创建和建立一个新项目的脚手架

source: how to deal with extensions
zh_cn: 如何处理扩展

source: how to develop your application in your IDE
zh_cn: 如何在你的IDE中开发应用程序

source: how to enable live reload
zh_cn: 如何启用实时重载

source: how to setup Quarkus tools in xref:ide-tooling.adoc[Visual Studio Code, Eclipse IDE, Eclipse Che and IntelliJ]
zh_cn: 如何在 xref:ide-tooling.adoc[Visual Studio Code、Eclipse IDE、Eclipse Che和IntelliJ] 中设置Quarkus工具

source: how to use the xref:cli-tooling.adoc[CLI] for your toolchain
zh_cn: 如何为你的工具链使用 xref:cli-tooling.adoc[CLI]

source: how to use xref:gradle-tooling.adoc[Gradle] as a build tool
zh_cn: 如何使用 xref:gradle-tooling.adoc[Gradle] 作为构建工具

source: how to use xref:maven-tooling.adoc[Maven] as a build tool
zh_cn: 如何使用 xref:maven-tooling.adoc[Maven] 作为构建工具

source: http://camel.apache.org/[Apache Camel] is the Swiss knife of integrating heterogeneous systems with more than a decade of history and a lively community of users and developers.
zh_cn: http://camel.apache.org/[Apache Camel] 是集成异构系统的瑞士军刀，拥有十多年的历史以及活跃的用户和开发人员社区。

source: http://localhost:8080/hello/Quarkus/array returns:
zh_cn: http://localhost:8080/hello/Quarkus/array 返回：

source: http://localhost:8080/hello/Quarkus/object returns:
zh_cn: http://localhost:8080/hello/Quarkus/object 返回：

source: https://access.redhat.com/security/team/contact/[Red Hat]
zh_cn: https://access.redhat.com/security/team/contact/[红帽]

source: https://catalog.redhat.com/software/container-stacks/detail/5ec53f50ef29fd35586d9a56[Red Hat Universal Base Image 8]
zh_cn: https://catalog.redhat.com/software/container-stacks/detail/5ec53f50ef29fd35586d9a56[红帽通用基础镜像8]

source: https://che.openshift.io/f?url=https://raw.githubusercontent.com/redhat-developer/devfile/master/getting-started/quarkus/devfile.yaml[Start Che Workspace]
zh_cn: link:https://che.openshift.io/f?url=https://raw.githubusercontent.com/redhat-developer/devfile/master/getting-started/quarkus/devfile.yaml[开始使用Che Workspace]

source: https://cloud.redhat.com/[Red Hat OpenShift Streams for Apache Kafka] provides managed Kafka brokers. First, follow the instructions from https://access.redhat.com/documentation/en-us/red_hat_openshift_streams_for_apache_kafka/1/guide/88e1487a-2a14-4b35-85b9-a7a2d67a37f3[Getting started with the `rhoas` CLI for Red Hat OpenShift Streams for Apache Kafka] to create your Kafka broker instance. Make sure you copied the client id and client secret associated with the _ServiceAccount_ you created.
zh_cn: link:https://cloud.redhat.com/[红帽OpenShift Streams for Apache Kafka] 提供了受管理的Kafka brokers。首先，按照 link:https://access.redhat.com/documentation/en-us/red_hat_openshift_streams_for_apache_kafka/1/guide/88e1487a-2a14-4b35-85b9-a7a2d67a37f3[红帽OpenShift Streams for Apache Kafka的 `rhoas` 命令行入门] 的说明，创建您的Kafka broker实例。请确保您复制了与您创建的 _ServiceAccount_ 相关的客户ID和客户密码。

source: https://docs.aws.amazon.com/serverless-application-model/latest/developerguide/serverless-sam-cli-install.html[AWS SAM CLI], for local testing
zh_cn: link:https://docs.aws.amazon.com/serverless-application-model/latest/developerguide/serverless-sam-cli-install.html[AWS SAM CLI] ，用于本地测试

source: https://docs.microsoft.com/en-us/azure/event-hubs/event-hubs-for-kafka-ecosystem-overview[Azure Event Hub] provides an endpoint compatible with Apache Kafka.
zh_cn: link:https://docs.microsoft.com/en-us/azure/event-hubs/event-hubs-for-kafka-ecosystem-overview[Azure Event Hub] 提供了一个与Apache Kafka兼容的节点。

source: https://download.jboss.org/jbosstools/photon/snapshots/builds/jbosstools-quarkus_master/[Development Update Site]
zh_cn: link:https://download.jboss.org/jbosstools/photon/snapshots/builds/jbosstools-quarkus_master/[开发更新站点]

source: https://en.wikipedia.org/wiki/YAML[YAML] is a very popular format. Kubernetes relies heavily on the YAML format to write the various resource descriptors.
zh_cn: link:https://en.wikipedia.org/wiki/YAML[YAML] 是一种非常流行的格式。Kubernetes高度依赖YAML格式来编写各种资源描述符。

source: https://flywaydb.org/[Flyway] is a popular database migration tool that is commonly used in JVM environments.
zh_cn: link:https://flywaydb.org/[Flyway] 是一个流行的数据库迁移工具，通常用于JVM环境。

source: https://github.com/jbosstools/jbosstools-quarkus[GitHub]
zh_cn: link:https://github.com/jbosstools/jbosstools-quarkus[GitHub]

source: https://github.com/redhat-developer/intellij-quarkus[GitHub]
zh_cn: link:https://github.com/redhat-developer/intellij-quarkus[GitHub]

source: https://github.com/redhat-developer/vscode-quarkus[GitHub]
zh_cn: link:https://github.com/redhat-developer/vscode-quarkus[GitHub]

source: https://kafka.apache.org[Apache Kafka] is a popular open-source distributed event streaming platform. It is used commonly for high-performance data pipelines, streaming analytics, data integration, and mission-critical applications. Similar to a message queue, or an enterprise messaging platform, it lets you:
zh_cn: link:https://kafka.apache.org[Apache Kafka] 是一个流行的开源分布式事件流平台。它通常用于高性能数据管道、流式分析、数据集成以及任务关键型应用。类似于消息队列或企业消息平台，它可以允许您：

source: https://kotlinlang.org/[Kotlin] is a very popular programming language that targets the JVM (amongst other environments). Kotlin has experienced a surge in popularity the last few years making it the most popular JVM language, except for Java of course.
zh_cn: link:https://kotlinlang.org/[Kotlin] 是一种非常流行的基于JVM的编程语言（在其他环境中）。在过去的几年里，Kotlin的受欢迎程度激增，使其成为最受欢迎的JVM语言，当然，除了Java之外。

source: https://marketplace.eclipse.org/content/quarkus-tools[Quarkus Tools for Eclipse]
zh_cn: link:https://marketplace.eclipse.org/content/quarkus-tools[用于Eclipse的Quarkus工具]

source: https://marketplace.visualstudio.com/items?itemName=redhat.vscode-quarkus[Marketplace] {empty} + https://download.jboss.org/jbosstools/vscode/snapshots/vscode-quarkus/?C=M;O=D[Development Builds]
zh_cn: link:https://marketplace.visualstudio.com/items?itemName=redhat.vscode-quarkus[插件市场] link:https://download.jboss.org/jbosstools/vscode/snapshots/vscode-quarkus/?C=M;O=D[构建产物归档]

source: https://marketplace.visualstudio.com/items?itemName=redhat.vscode-quarkus[Quarkus Tools for Visual Studio Code]
zh_cn: link:https://marketplace.visualstudio.com/items?itemName=redhat.vscode-quarkus[用于Visual Studio Code的Quarkus工具]

source: https://plugins.jetbrains.com/plugin/13234-quarkus/versions[Marketplace] {empty} + https://download.jboss.org/jbosstools/intellij/snapshots/intellij-quarkus/[Development Builds]
zh_cn: link:https://plugins.jetbrains.com/plugin/13234-quarkus/versions[插件市场] link:https://download.jboss.org/jbosstools/intellij/snapshots/intellij-quarkus/[构建产物归档]

source: https://plugins.jetbrains.com/plugin/13234-quarkus/versions[Quarkus Tools for IntelliJ IDEA]
zh_cn: link:https://plugins.jetbrains.com/plugin/13234-quarkus/versions[用于IntelliJ IDEA的Quarkus工具]

source: https://quarkus.io/guides/amqp
zh_cn: https://cn.quarkus.io/guides/amqp

source: https://quarkus.io/guides/kafka
zh_cn: https://cn.quarkus.io/guides/kafka

source: https://quarkus.io/guides/mailer
zh_cn: https://cn.quarkus.io/guides/mailer

source: https://quarkus.io/guides/mqtt
zh_cn: https://cn.quarkus.io/guides/mqtt

source: https://quarkus.io/guides/reactive-sql-clients
zh_cn: https://cn.quarkus.io/guides/reactive-sql-clients

source: https://quarkus.io/guides/redis
zh_cn: https://cn.quarkus.io/guides/redis

source: https://stedolan.github.io/jq/[jq tool]
zh_cn: link:https://stedolan.github.io/jq/[jq工具]

source: https://vertx.io/docs/apidocs/io/vertx/core/json/JsonObject.html[`JsonObject`]
zh_cn: link:https://vertx.io/docs/apidocs/io/vertx/core/json/JsonObject.html[`JsonObject`]

source: https://vertx.io/docs/apidocs/io/vertx/core/json/JsonObject.html[`JsonObject`] or https://vertx.io/docs/apidocs/io/vertx/core/json/JsonArray.html[`JsonArray`]
zh_cn: link:https://vertx.io/docs/apidocs/io/vertx/core/json/JsonObject.html[`JsonObject`] 或 link:https://vertx.io/docs/apidocs/io/vertx/core/json/JsonArray.html[`JsonArray`]

source: https://vertx.io[Vert.x] is a toolkit for building reactive applications. As described in the xref:quarkus-reactive-architecture.adoc[Quarkus Reactive Architecture], Quarkus uses Vert.x underneath.
zh_cn: link:https://vertx.io[Vert.x] 是一个用于构建响应式应用程序的工具集。正如 link:quarkus-reactive-architecture.html[Quarkus响应式架构] 中所描述的，下面，Quarkus将使用Vert.x。

source: https://webauthn.guide/[WebAuthn] is an authentication mechanism that replaces passwords. When you write a service for registering new users, or logging them in, instead of asking for a password, you can use WebAuthn, which replaces the password. For more information, see xref:security-webauthn.adoc[Secure a Quarkus application by using the WebAuthn authentication mechanism].
zh_cn: link:https://webauthn.guide/[WebAuthn] 是一种旨在取代密码的认证机制。简而言之，每当您写一个注册新用户或提供登录的服务，您就可以使用WebAuthn来代替使用密码的方式。更多信息，请参阅 link:security-webauthn.html[使用WebAuthn 认证机制保护 Quarkus 应用程序].
